---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceDidNotRegenerateProperly
source: html/59839404-b061-9c51-7144-e21b4c2514ce.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceDidNotRegenerateProperly Property

Divided Surface gridlines could not be generated.

## Syntax (C#)
```csharp
public static FailureDefinitionId DividedSurfaceDidNotRegenerateProperly { get; }
```